wrk8/wrk_5003_r_Heavy.txt
wrk -t 3 -c 3 -d180 -R 50 -math 0 --latency http://13.0.0.29:8081/high/web350m.html
Running 3m test @ http://13.0.0.29:8081/high/web350m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 9826.304ms, rate sampling interval: 19660ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.60m    45.42s    2.84m    53.85%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    96403.46 ms
 75.000%    132317.18 ms
 90.000%    155582.46 ms
 99.000%    170262.53 ms
 99.900%    170262.53 ms
 99.990%    170262.53 ms
 99.999%    170262.53 ms
100.000%    170262.53 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   22085.631     0.000000            1         1.00
   35192.831     0.100000            2         1.11
   47742.975     0.200000            3         1.25
   60555.263     0.300000            4         1.43
   85196.799     0.400000            6         1.67
   96403.455     0.500000            7         2.00
  108789.759     0.550000            8         2.22
  108789.759     0.600000            8         2.50
  120061.951     0.650000            9         2.86
  132317.183     0.700000           10         3.33
  132317.183     0.750000           10         4.00
  144179.199     0.775000           11         4.44
  144179.199     0.800000           11         5.00
  144179.199     0.825000           11         5.71
  155582.463     0.850000           12         6.67
  155582.463     0.875000           12         8.00
  155582.463     0.887500           12         8.89
  155582.463     0.900000           12        10.00
  155582.463     0.912500           12        11.43
  170262.527     0.925000           13        13.33
  170262.527     1.000000           13          inf
#[Mean    =    96225.122, StdDeviation   =    45419.434]
#[Max     =   170131.456, Total count    =           13]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    10059.77 ms
 75.000%    10551.30 ms
 90.000%    11190.27 ms
 99.000%    12214.27 ms
 99.900%    12214.27 ms
 99.990%    12214.27 ms
 99.999%    12214.27 ms
100.000%    12214.27 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9863.167     0.000000            1         1.00
    9920.511     0.100000            2         1.11
    9969.663     0.200000            5         1.25
    9969.663     0.300000            5         1.43
   10010.623     0.400000            6         1.67
   10059.775     0.500000            7         2.00
   10330.111     0.550000            8         2.22
   10330.111     0.600000            8         2.50
   10403.839     0.650000            9         2.86
   10551.295     0.700000           10         3.33
   10551.295     0.750000           10         4.00
   10854.399     0.775000           11         4.44
   10854.399     0.800000           11         5.00
   10854.399     0.825000           11         5.71
   11190.271     0.850000           12         6.67
   11190.271     0.875000           12         8.00
   11190.271     0.887500           12         8.89
   11190.271     0.900000           12        10.00
   11190.271     0.912500           12        11.43
   12214.271     0.925000           13        13.33
   12214.271     1.000000           13          inf
#[Mean    =    10404.155, StdDeviation   =      649.883]
#[Max     =    12206.080, Total count    =           13]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  14 requests in 3.01m, 5.06GB read
  Socket errors: connect 0, read 0, write 0, timeout 71
Requests/sec:      0.08
Transfer/sec:     28.67MB
Running 3m test @ http://13.0.0.29:8081/high/web350m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 9998.336ms, rate sampling interval: 20004ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.58m    45.10s    2.85m    53.85%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    94044.16 ms
 75.000%    130613.25 ms
 90.000%    153092.10 ms
 99.000%    170917.89 ms
 99.900%    170917.89 ms
 99.990%    170917.89 ms
 99.999%    170917.89 ms
100.000%    170917.89 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   22364.159     0.000000            1         1.00
   34668.543     0.100000            2         1.11
   46989.311     0.200000            3         1.25
   59375.615     0.300000            4         1.43
   82837.503     0.400000            6         1.67
   94044.159     0.500000            7         2.00
  106364.927     0.550000            8         2.22
  106364.927     0.600000            8         2.50
  117571.583     0.650000            9         2.86
  130613.247     0.700000           10         3.33
  130613.247     0.750000           10         4.00
  141819.903     0.775000           11         4.44
  141819.903     0.800000           11         5.00
  141819.903     0.825000           11         5.71
  153092.095     0.850000           12         6.67
  153092.095     0.875000           12         8.00
  153092.095     0.887500           12         8.89
  153092.095     0.900000           12        10.00
  153092.095     0.912500           12        11.43
  170917.887     0.925000           13        13.33
  170917.887     1.000000           13          inf
#[Mean    =    94686.287, StdDeviation   =    45102.240]
#[Max     =   170786.816, Total count    =           13]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    9961.47 ms
 75.000%    10002.43 ms
 90.000%    10764.29 ms
 99.000%    15417.34 ms
 99.900%    15417.34 ms
 99.990%    15417.34 ms
 99.999%    15417.34 ms
100.000%    15417.34 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9863.167     0.000000            1         1.00
    9879.551     0.100000            2         1.11
    9920.511     0.200000            3         1.25
    9928.703     0.300000            5         1.43
    9953.279     0.400000            6         1.67
    9961.471     0.500000            7         2.00
    9977.855     0.550000            8         2.22
    9977.855     0.600000            8         2.50
    9986.047     0.650000            9         2.86
   10002.431     0.700000           10         3.33
   10002.431     0.750000           10         4.00
   10100.735     0.775000           11         4.44
   10100.735     0.800000           11         5.00
   10100.735     0.825000           11         5.71
   10764.287     0.850000           12         6.67
   10764.287     0.875000           12         8.00
   10764.287     0.887500           12         8.89
   10764.287     0.900000           12        10.00
   10764.287     0.912500           12        11.43
   15417.343     0.925000           13        13.33
   15417.343     1.000000           13          inf
#[Mean    =    10433.142, StdDeviation   =     1454.718]
#[Max     =    15409.152, Total count    =           13]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  14 requests in 3.02m, 5.06GB read
  Socket errors: connect 0, read 0, write 0, timeout 68
Requests/sec:      0.08
Transfer/sec:     28.56MB
Running 3m test @ http://13.0.0.29:8081/high/web350m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.57m    50.20s    2.89m    57.14%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    90767.36 ms
 75.000%    138149.89 ms
 90.000%    161218.56 ms
 99.000%    173408.26 ms
 99.900%    173408.26 ms
 99.990%    173408.26 ms
 99.999%    173408.26 ms
100.000%    173408.26 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   11321.343     0.000000            1         1.00
   24592.383     0.100000            2         1.11
   36765.695     0.200000            3         1.25
   65863.679     0.300000            5         1.43
   78446.591     0.400000            6         1.67
   90767.359     0.500000            7         2.00
  101974.015     0.550000            8         2.22
  114294.783     0.600000            9         2.50
  125698.047     0.650000           10         2.86
  125698.047     0.700000           10         3.33
  138149.887     0.750000           11         4.00
  138149.887     0.775000           11         4.44
  149422.079     0.800000           12         5.00
  149422.079     0.825000           12         5.71
  149422.079     0.850000           12         6.67
  161218.559     0.875000           13         8.00
  161218.559     0.887500           13         8.89
  161218.559     0.900000           13        10.00
  161218.559     0.912500           13        11.43
  161218.559     0.925000           13        13.33
  173408.255     0.937500           14        16.00
  173408.255     1.000000           14          inf
#[Mean    =    94327.662, StdDeviation   =    50198.880]
#[Max     =   173277.184, Total count    =           14]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    10059.77 ms
 75.000%    10919.93 ms
 90.000%    11354.11 ms
 99.000%    14352.38 ms
 99.900%    14352.38 ms
 99.990%    14352.38 ms
 99.999%    14352.38 ms
100.000%    14352.38 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9830.399     0.000000            1         1.00
    9920.511     0.100000            3         1.11
    9920.511     0.200000            3         1.25
    9977.855     0.300000            5         1.43
    9994.239     0.400000            6         1.67
   10059.775     0.500000            7         2.00
   10125.311     0.550000            8         2.22
   10133.503     0.600000            9         2.50
   10526.719     0.650000           10         2.86
   10526.719     0.700000           10         3.33
   10919.935     0.750000           11         4.00
   10919.935     0.775000           11         4.44
   11321.343     0.800000           12         5.00
   11321.343     0.825000           12         5.71
   11321.343     0.850000           12         6.67
   11354.111     0.875000           13         8.00
   11354.111     0.887500           13         8.89
   11354.111     0.900000           13        10.00
   11354.111     0.912500           13        11.43
   11354.111     0.925000           13        13.33
   14352.383     0.937500           14        16.00
   14352.383     1.000000           14          inf
#[Mean    =    10594.597, StdDeviation   =     1156.056]
#[Max     =    14344.192, Total count    =           14]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  14 requests in 3.00m, 4.92GB read
  Socket errors: connect 0, read 0, write 0, timeout 69
Requests/sec:      0.08
Transfer/sec:     28.00MB